test/SOAP-PAYLOAD

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
        <ns1:MFTHeader xmlns:ns1="http://xmlns.oracle.com/fmw/mft/soap">
            <ns1:TargetFilename>%%FILEBASE%%</ns1:TargetFilename>
            <ns1:file.name>%%FILEBASE%%</ns1:file.name>
        </ns1:MFTHeader>
    </soap:Header>
    <soap:Body>
        <ns1:MFTServiceInput xmlns:ns1="http://xmlns.oracle.com/fmw/mft/soap" PayloadType="InlineBinary">
            <ns1:BinaryPayload><![CDATA[%%FILEBODY%%]]></ns1:BinaryPayload>
        </ns1:MFTServiceInput>
    </soap:Body>
</soap:Envelope>
